Австралия/src/Catalogs/InventoryOwnership/InventoryOwnership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>InventoryOwnership</name>
  <attributes>
    <name>OwnershipType</name>
    <type>
      <types>EnumRef.InventoryOwnershipTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Enums/InventoryOwnershipTypes/InventoryOwnershipTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>InventoryOwnershipTypes</name>
  <enumValues>
    <name>OwnInventory</name>
  </enumValues>
  <enumValues>
    <name>CounterpartysInventory</name>
  </enumValues>
  <enumValues>
    <name>CustomerProvidedInventory</name>
  </enumValues>
  <enumValues>
    <name>CustomerOwnedInventory</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/InventoryOwnership/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If OwnershipType <> Enums.InventoryOwnershipTypes.CounterpartysInventory Then
		DriveServer.DeleteAttributeBeingChecked(CheckedAttributes, "Counterparty");
		DriveServer.DeleteAttributeBeingChecked(CheckedAttributes, "Contract");
	EndIf;
	
EndProcedure

Procedure BeforeWrite(Cancel)
	
	If IsBlankString(Description) Then
		
		If OwnershipType = Enums.InventoryOwnershipTypes.OwnInventory Then
			
			Description = String(OwnershipType);
			
		ElsIf Constants.UseContractsWithCounterparties.Get() Then
			
			Description = StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = '%1 (%2)'; ru = '%1 (%2)';pl = '%1 (%2)';es_ES = '%1 (%2)';es_CO = '%1 (%2)';tr = '%1 (%2)';it = '%1 (%2)';de = '%1 (%2)'"),
				Counterparty,
				Contract);
				
		Else
			
			Description = StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = '%1'; ru = '%1';pl = '%1';es_ES = '%1';es_CO = '%1';tr = '%1';it = '%1';de = '%1'"),
				Counterparty);
			
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
